doc/hazards.org
#+TITLE: Static GC Rooting Hazard Analysis
#+OPTIONS: ^:nil

* Problem definition

** The rule: Thou Shalt Not Hold a GC Pointer Live Across a (Potential) GC

A simple non-hazard:

#+BEGIN_SRC
    void hydrogen() {
      JSObject* obj = getObject();
      doSomethingThatMightGC();
    }
#+END_SRC

Whatever holds obj will be invalidated, but it doesn't matter, since it isn't
used afterwards.

** Most basic hazard

#+BEGIN_SRC
    void helium() {
      JSObject* obj = getObject();
      doSomethingThatMightGC();
      use(obj);
    }
#+END_SRC

obj is a valid GC pointer. doSomethingThatMightGC() runs, triggers GC, and the
GC moves obj somewhere else. The GC has no way of updating obj (it might be on
the stack, or in a register), so it continues pointing to the old location.

** Tricky hazard 1

#+BEGIN_SRC
    void lithium(JSObject* obj) {
      MarkUsed raii(obj);
      doSomethingThatMightGC();
    }
#+END_SRC

#+BEGIN_SRC
    class MarkUsed {
      JSObject* mObj;

    public:

      MarkUsed(JSObject* obj) : mObj(obj) { JS::SetProperty(mObj, "used", true); }
      ~SetUnused() { JS::SetProperty(mObj, "used", false); }
    };
#+END_SRC

~obj~ is used in the destructor at the end of scope, so ~obj~ is live across
doSomethingThatMightGC().

** Rooting

Not a hazard:

#+BEGIN_SRC
    void beryllium(JSContext* cx) {
      Rooted<JSObject*> obj(cx, JS::NewObject());
      doSomethingThatMightGC();
      use(obj);
    }
#+END_SRC

** Tricky hazard 2

#+BEGIN_SRC
    class Cleanup {
    public:
      Cleanup() {}
      ~Cleanup() { doSomethingThatMightGC(); }
    };

    JSObject* boron(JSContext* cx) {
      Cleanup cleanup;
      Rooted<JSObject*> obj(cx, JS::NewObject());
      doSomethingThatMightGC();
      return obj;
    }
#+END_SRC

** Easy fix (that doesn't work)

#+BEGIN_SRC
    class Cleanup {
      public:
        Cleanup() {}
        ~Cleanup() { doSomethingThatMightGC(); }
    };

    JSObject* boron(JSContext* cx) {
      Rooted<JSObject*> obj(cx, JS::NewObject());
      Cleanup cleanup; // <-- Look! ~Cleanup() happens while obj is still rooted!
      doSomethingThatMightGC();
      return obj;
    }
#+END_SRC

* Hazard analysis

** Overview
*** Global analysis

The rooting hazard analysis is a global (whole-program) analysis as opposed to
the function-local analysis like the current clang-based static analyses that
we're using.

- /local/: look at one function at a time in isolation
- /global/: use information gathered from the entire source tree
  - even if the main processing looks at a function at a time

There has been talk about implementating a global analysis infrastructure on
top of the clang plugin based analysis setup, but no concrete plans as yet.
(Such things have been implemented, eg PhASAR, but I haven't looked at them.)

*** Static

Some code paths may never be invoked in practice, but the analysis will assume
that they might be.

*** Conservative

- Any function pointer will be assumed to call something that can GC, unless
  annotated otherwise.
- Some paths leading to a GC can never be taken.
- Some GC pointer variables will never store a GC pointer (eg JS::Value that
  only holds undefined or numeric values in practice)

*** Unsound

- Analysis relies on the C++ type system
  - if you cast to void* or uintptr_t, the analysis can't see it.
  - Container types (eg hashtables) need to be specifically annotated for the
    analysis to know that the overall array requires rooting.
    - eg HashMap<T> needs rooting iff T needs rooting
- If you take the address of a GC pointer, the analysis loses track of it.
  - It will not complain if you hold a pointer to a pointer live across a GC.
    - If that pointer is rooted or traced, this is ok.
    - But at the point of the GC, we don't know if it is or not.
- Some interior pointers (eg the pointer to the characters in a string) are
  not considered to be invalidatable GC pointers.
  - We have classes for managing these more safely, as well as (dynamically
    enforced) IPromiseIWillNotGC tokens.
    - AutoSuppressGCAnalysis, AutoCheckCannotGC
    - *not* AutoAssertNoGC (which is a dynamic check that does not disable the
      static checking)
- Some hard-to-handle cases are annotated away.

*** Incomplete

- To be fully conservatively correct, callgraph should include an edge through
  any function pointer invocation to every other function in the program.
  - Executing JS source *is* assumed to call any native JS function in existence.

*** Buggy

- The conversion from C++ to the Sixgill data structures is not perfect.
- gcc lies occasionally
- some rare constructs are not handled and result in that function body being
  discarded
  - I keep track of how many of these there are
- some correctness fixes find too many false alarms (work is ongoing)
  - Big one: virtual method resolution is incorrect.
- sfink writes buggy code

