doc/hazards.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-02-02 Sun 20:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Static GC Rooting Hazard Analysis</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Steve Fink" />
</head>
<body>
<div id="content">
<h1 class="title">Static GC Rooting Hazard Analysis</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1463627">1. Problem definition</a>
<ul>
<li><a href="#org42d301f">1.1. The rule: Thou Shalt Not Hold a GC Pointer Live Across a (Potential) GC</a></li>
<li><a href="#org9e56453">1.2. Most basic hazard</a></li>
<li><a href="#org5e0e3b5">1.3. Tricky hazard 1</a></li>
<li><a href="#orge165dab">1.4. Rooting</a></li>
<li><a href="#orged2fac6">1.5. Tricky hazard 2</a></li>
<li><a href="#org1a93de1">1.6. Easy fix (that doesn't work)</a></li>
</ul>
</li>
<li><a href="#org6efd6b8">2. Hazard analysis</a>
<ul>
<li><a href="#orgd959475">2.1. Overview</a>
<ul>
<li><a href="#orgfc4ef92">2.1.1. Global analysis</a></li>
<li><a href="#org76fa4e7">2.1.2. Static</a></li>
<li><a href="#orgb1eb57c">2.1.3. Conservative</a></li>
<li><a href="#org271eeb4">2.1.4. Unsound</a></li>
<li><a href="#org0eb1192">2.1.5. Incomplete</a></li>
<li><a href="#org3048cb7">2.1.6. Buggy</a></li>
</ul>
</li>
<li><a href="#org58c3f3d">2.2. How do you run the blasted thing?</a></li>
<li><a href="#org3f99ad8">2.3. Operational Overview</a></li>
<li><a href="#orgdf8847b">2.4. Data structures</a>
<ul>
<li><a href="#org20246b2">2.4.1. gcc data structure</a></li>
<li><a href="#org43fc24e">2.4.2. sixgill data structures</a></li>
</ul>
</li>
<li><a href="#org03c6b81">2.5. Compilation</a>
<ul>
<li><a href="#org8e037b7">2.5.1. Annotations</a></li>
</ul>
</li>
<li><a href="#orgbcd4bc3">2.6. Processing of generated data structures</a>
<ul>
<li><a href="#org1a7e914">2.6.1. Compute the global callgraph</a></li>
<li><a href="#org4785a52">2.6.2. Compute the set of GC types and GC pointers</a></li>
<li><a href="#orgf66e36f">2.6.3. Compute the set of functions that can GC.</a></li>
<li><a href="#org19833fc">2.6.4. Analyze every function in the code base</a></li>
<li><a href="#org47baf7d">2.6.5. In-depth look at main analysis function</a></li>
<li><a href="#org427c8d5">2.6.6. Ideas for additional analyses with same infrastructure</a></li>
</ul>
</li>
<li><a href="#orgba699e1">2.7. XDB files</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org1463627" class="outline-2">
<h2 id="org1463627"><span class="section-number-2">1</span> Problem definition</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org42d301f" class="outline-3">
<h3 id="org42d301f"><span class="section-number-3">1.1</span> The rule: Thou Shalt Not Hold a GC Pointer Live Across a (Potential) GC</h3>
<div class="outline-text-3" id="text-1-1">
<p>
A simple non-hazard:
</p>

<pre class="example">
void hydrogen() {
  JSObject* obj = getObject();
  doSomethingThatMightGC();
}
</pre>

<p>
Whatever holds obj will be invalidated, but it doesn't matter, since it isn't
used afterwards.
</p>
</div>
</div>

<div id="outline-container-org9e56453" class="outline-3">
<h3 id="org9e56453"><span class="section-number-3">1.2</span> Most basic hazard</h3>
<div class="outline-text-3" id="text-1-2">
<pre class="example">
void helium() {
  JSObject* obj = getObject();
  doSomethingThatMightGC();
  use(obj);
}
</pre>

<p>
obj is a valid GC pointer. doSomethingThatMightGC() runs, triggers GC, and the
GC moves obj somewhere else. The GC has no way of updating obj (it might be on
the stack, or in a register), so it continues pointing to the old location.
</p>
</div>
</div>

<div id="outline-container-org5e0e3b5" class="outline-3">
<h3 id="org5e0e3b5"><span class="section-number-3">1.3</span> Tricky hazard 1</h3>
<div class="outline-text-3" id="text-1-3">
<pre class="example">
void lithium(JSObject* obj) {
  MarkUsed raii(obj);
  doSomethingThatMightGC();
}
</pre>

<pre class="example">
class MarkUsed {
  JSObject* mObj;

public:

  MarkUsed(JSObject* obj) : mObj(obj) { JS::SetProperty(mObj, "used", true); }
  ~SetUnused() { JS::SetProperty(mObj, "used", false); }
};
</pre>

<p>
<code>obj</code> is used in the destructor at the end of scope, so <code>obj</code> is live across
doSomethingThatMightGC().
</p>
</div>
</div>

<div id="outline-container-orge165dab" class="outline-3">
<h3 id="orge165dab"><span class="section-number-3">1.4</span> Rooting</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Not a hazard:
</p>

<pre class="example">
void beryllium(JSContext* cx) {
  Rooted&lt;JSObject*&gt; obj(cx, JS::NewObject());
  doSomethingThatMightGC();
  use(obj);
}
</pre>
</div>
</div>

<div id="outline-container-orged2fac6" class="outline-3">
<h3 id="orged2fac6"><span class="section-number-3">1.5</span> Tricky hazard 2</h3>
<div class="outline-text-3" id="text-1-5">
<pre class="example">
class Cleanup {
public:
  Cleanup() {}
  ~Cleanup() { doSomethingThatMightGC(); }
};

JSObject* boron(JSContext* cx) {
  Cleanup cleanup;
  Rooted&lt;JSObject*&gt; obj(cx, JS::NewObject());
  doSomethingThatMightGC();
  return obj;
}
</pre>
</div>
</div>

<div id="outline-container-org1a93de1" class="outline-3">
<h3 id="org1a93de1"><span class="section-number-3">1.6</span> Easy fix (that doesn't work)</h3>
<div class="outline-text-3" id="text-1-6">
<pre class="example">
class Cleanup {
  public:
    Cleanup() {}
    ~Cleanup() { doSomethingThatMightGC(); }
};

JSObject* boron(JSContext* cx) {
  Rooted&lt;JSObject*&gt; obj(cx, JS::NewObject());
  Cleanup cleanup; // &lt;-- Look! ~Cleanup() happens while obj is still rooted!
  doSomethingThatMightGC();
  return obj;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org6efd6b8" class="outline-2">
<h2 id="org6efd6b8"><span class="section-number-2">2</span> Hazard analysis</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgd959475" class="outline-3">
<h3 id="orgd959475"><span class="section-number-3">2.1</span> Overview</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orgfc4ef92" class="outline-4">
<h4 id="orgfc4ef92"><span class="section-number-4">2.1.1</span> Global analysis</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
The rooting hazard analysis is a global (whole-program) analysis as opposed to
the function-local analysis like the current clang-based static analyses that
we're using.
</p>

<ul class="org-ul">
<li><i>local</i>: look at one function at a time in isolation</li>
<li><i>global</i>: use information gathered from the entire source tree
<ul class="org-ul">
<li>even if the main processing looks at a function at a time</li>
</ul></li>
</ul>

<p>
There has been talk about implementating a global analysis infrastructure on
top of the clang plugin based analysis setup, but no concrete plans as yet.
(Such things have been implemented, eg PhASAR, but I haven't looked at them.)
</p>
</div>
</div>

<div id="outline-container-org76fa4e7" class="outline-4">
<h4 id="org76fa4e7"><span class="section-number-4">2.1.2</span> Static</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
Some code paths may never be invoked in practice, but the analysis will assume
that they might be.
</p>
</div>
</div>

<div id="outline-container-orgb1eb57c" class="outline-4">
<h4 id="orgb1eb57c"><span class="section-number-4">2.1.3</span> Conservative</h4>
<div class="outline-text-4" id="text-2-1-3">
<ul class="org-ul">
<li>Any function pointer will be assumed to call something that can GC, unless
annotated otherwise.</li>
<li>Some paths leading to a GC can never be taken.</li>
<li>Some GC pointer variables will never store a GC pointer (eg JS::Value that
only holds undefined or numeric values in practice)</li>
</ul>
</div>
</div>

<div id="outline-container-org271eeb4" class="outline-4">
<h4 id="org271eeb4"><span class="section-number-4">2.1.4</span> Unsound</h4>
<div class="outline-text-4" id="text-2-1-4">
<ul class="org-ul">
<li>Analysis relies on the C++ type system
<ul class="org-ul">
<li>if you cast to void* or uintptr_t, the analysis can't see it.</li>
<li>Container types (eg hashtables) need to be specifically annotated for the
analysis to know that the overall array requires rooting.
<ul class="org-ul">
<li>eg HashMap&lt;T&gt; needs rooting iff T needs rooting</li>
</ul></li>
</ul></li>
<li>If you take the address of a GC pointer, the analysis loses track of it.
<ul class="org-ul">
<li>It will not complain if you hold a pointer to a pointer live across a GC.
<ul class="org-ul">
<li>If that pointer is rooted or traced, this is ok.</li>
<li>But at the point of the GC, we don't know if it is or not.</li>
</ul></li>
</ul></li>
<li>Some interior pointers (eg the pointer to the characters in a string) are
not considered to be invalidatable GC pointers.
<ul class="org-ul">
<li>We have classes for managing these more safely, as well as (dynamically
enforced) IPromiseIWillNotGC tokens.
<ul class="org-ul">
<li>AutoSuppressGCAnalysis, AutoCheckCannotGC</li>
<li><b>not</b> AutoAssertNoGC (which is a dynamic check that does not disable the
static checking)</li>
</ul></li>
</ul></li>
<li>Some hard-to-handle cases are annotated away.</li>
</ul>
</div>
</div>

<div id="outline-container-org0eb1192" class="outline-4">
<h4 id="org0eb1192"><span class="section-number-4">2.1.5</span> Incomplete</h4>
<div class="outline-text-4" id="text-2-1-5">
<ul class="org-ul">
<li>To be fully conservatively correct, callgraph should include an edge through
any function pointer invocation to every other function in the program.
<ul class="org-ul">
<li>Executing JS source <b>is</b> assumed to call any native JS function in existence.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org3048cb7" class="outline-4">
<h4 id="org3048cb7"><span class="section-number-4">2.1.6</span> Buggy</h4>
<div class="outline-text-4" id="text-2-1-6">
<ul class="org-ul">
<li>The conversion from C++ to the Sixgill data structures is not perfect.</li>
<li>gcc lies occasionally</li>
<li>some rare constructs are not handled and result in that function body being
discarded
<ul class="org-ul">
<li>I keep track of how many of these there are</li>
</ul></li>
<li>some correctness fixes find too many false alarms (work is ongoing)
<ul class="org-ul">
<li>Big one: virtual method resolution is incorrect.</li>
</ul></li>
<li>sfink writes buggy code</li>
</ul>
</div>
</div>
</div>
