doc/hazards.org
** How do you run the blasted thing?

- Easiest way: push to try.
- If you want to hack on the analysis:
  - push to try with ~--upload-xdbs~
  - use ~js/src/devtools/rootAnalysis/analyze.py --first rawcalls~
- If you are very brave, try to follow the instructions in
  ~js/src/devtools/rootAnalysis/README.md~
- I am working on making it entirely runnable from ~mach~.

#+BEGIN_SRC
# Install sixgill, matching gcc
mach hazards bootstrap

# Build a shell to run the analysis with
mach hazards build-shell

# Compile the tree and gather analysis info
mach hazards gather

# Analyze the gathered data and report on hazards
mach hazards analyze
#+END_SRC

** Operational Overview

1. Start up a server to gather the results of compilation
2. Compile the entire source tree, with a plugin that sends the control flow
   graph over to the server.
3. Compile a JS shell (optimized, no debug, --enable-ctypes)
4. Run the shell on some JS scripts that load in the compilation results and
   analyzes them.

(More details later)

** Data structures
*** gcc data structure

- nasty awful opaque 'tree' type with unions of structs of unions of unions...
- accessed via macros, some of which typecheck
- newer features reuse old fields and accessors
- it all feels pretty random

#+BEGIN_SRC
bool XIL_IsBaseField(tree field, bool *offset_zero)
{
  if (c_dialect_cxx() && DECL_NAME(field) == NULL) {
    tree type = TREE_TYPE(field);
    tree idnode = TYPE_NAME(type);
    if (TREE_CODE(type) == RECORD_TYPE && idnode &&
        TREE_CODE(idnode) == TYPE_DECL && !XIL_IsAnonymousCxx(idnode)) {
      // figure out if this field is at offset zero.
      tree offset = DECL_FIELD_OFFSET(field);
      tree bit_offset = DECL_FIELD_BIT_OFFSET(field);
      int byte_offset = TREE_UINT(offset) + (TREE_UINT(bit_offset) / 8);

      if (offset_zero)
        *offset_zero = (byte_offset == 0);
      return true;
    }
  }

  return false;
}
#+END_SRC

*** sixgill data structures
**** Sample C++ source

#+BEGIN_SRC
static void DeleteOffThreadJob(JSContext* cx, OffThreadJob* job) {
  ShellContext* sc = GetShellContext(cx);
  for (size_t i = 0; i < sc->offThreadJobs.length(); i++) {
    if (sc->offThreadJobs[i] == job) {
      sc->offThreadJobs.erase(&sc->offThreadJobs[i]);
      js_delete(job);
      return;
    }
  }

  MOZ_CRASH("Off-thread job not found");
}
#+END_SRC

**** Portion of sixgill output

#+BEGIN_EXAMPLE
block: _ZL1...$js.cpp:void DeleteOffThreadJob...:loop#0
pentry: 1
pexit:  6
Call(1,2, __temp_1 := sc*.offThreadJobs.length())
Assume(2,3, (i* < __temp_1*), true)
Call(3,4, __temp_2 := sc*.offThreadJobs.operator[](i*))
Assume(4,5, (__temp_2** ==p{js::shell::OffThreadJob} job*), false)
Assign(5,6, i := (i* + 1))

block: _ZL1...$js.cpp:void DeleteOffThreadJob...
pentry: 1
pexit:  15
Call(1,2, sc := GetShellContext(cx*))
Assign(2,3, i := 0)
Loop(3,4, loop#0)
Call(4,5, __temp_1 := sc*.offThreadJobs.length())
Assume(5,6, (i* < __temp_1*), true)
Assume(5,11, (i* < __temp_1*), false)
Call(6,7, __temp_2 := sc*.offThreadJobs.operator[](i*))
Assume(7,8, (__temp_2** ==p{js::shell::OffThreadJob} job*), true)
Call(8,9, __temp_3 := sc*.offThreadJobs.operator[](i*))
Call(9,10, sc*.offThreadJobs.erase(__temp_3*))
Call(10,15, js_delete(job*))
Call(11,12, MOZ_ReportCrash("Off-thread job not found","/builds/worker/checkouts/gecko/js/src/shell/js.cpp",390))
Call(12,13, AnnotateMozCrashReason("MOZ_CRASH(Off-thread job not found)"))
Assign(13,14, 0 := 390)
Call(14,15, abort())
#+END_EXAMPLE

QUESTION: In that loop body, why isn't there an edge from 2 -> 6?? (through an Assume)

**** Basic data structure setup

- Each function gets translated into a ~Block~.
- A ~Block~ has declarations and things, then one or more ~Body~s
  - One ~Body~ for the overall function body
  - One ~Body~ for each loop within the function
- A ~Body~ is a list of edges (type ~PEdge~)
- This is the control flow graph
- Edges connect ~PPoints~. All computation happens on the edges.
- ~PEdge~ has a field ~Index~ that gives the src and dst ~PPoint~s
- Edges can be one of a small number of types:
  - ~Assign~: assignment, lhs := rhs
  - ~Call~: function invocation. May also include an assignment of the returned value.
  - ~Assume~: branch of a conditional
  - ~Loop~: entry to a loop, represented by another ~Body~
  - ~Assembly~: inline assembly code
- ~PEdges~ contain values, which may be expressions
  - but no calls embedded within values; if that happens, the call will happen first and the return
    value assigned to a temporary that is then used within the value
- ~Body~s have a single entry point and a single exit point

**** Simplified example fragment

- Block "foo()"
  - pentry (ID of starting point)
  - pexit (ID of ending point)
  - PEdge
    - 0
      - Index: 1, 2 (this is the 1 -> 2 edge)
      - Kind: Assign
      - Type
        - Kind: Int
      - Exp
        - 0 (aka lhs)
          - Kind: Var
          - Variable
            - Kind: Local
            - Name: someLocalVariable
        - 1 (aka rhs)
          - Kind: Binop
          - OpCode: Plus
          - Exp
            - 0
              - Kind: Drf
              - ...more...
            - 1
              - ...more...


** Compilation

Only including what I think might be relevant to this audience.

*** Annotations

Currently expands to ~__attribute__((annotate("stuff")))~.

My apologies for the names. Surprisingly enough, I was *not* intentionally
going for the "I can haz cheezburger" vibe.

- JS_HAZ_GC_POINTER : this type holds a GC pointer, possibly encoded.
- JS_HAZ_ROOTED : this type roots its contained GC pointer.
- JS_HAZ_GC_INVALIDATED : this type contains something that is invalidated during a GC.
- JS_HAZ_ROOTED_BASE : all subclasses will be considered rooted
  - JS_HAZ_ROOTED type subclasses don't get this treatment. Most can't really
    be subclasses usefully in the first place, and they might add unrooted
    fields if they were.
- MOZ_INHERIT_TYPE_ANNOTATIONS_FROM_TEMPLATE_ARGS : shared with the clang-based
  static analyses, indicates that eg HashMap<T,U> is a GC pointer (well,
  invalidated by GC) iff T or U are GC pointers.

#+BEGIN_SRC

namespace JS {
class JS_HAZ_GC_POINTER Value { ... };

class JS_HAZ_ROOTED Rooted { ... };

class AutoCheckCannotGC : public AutoAssertNoGC {
  ...
} JS_HAZ_GC_INVALIDATED;

class JS_HAZ_ROOTED_BASE AutoRooter { ... }

} /* namespace JS */

class MOZ_INHERIT_TYPE_ANNOTATIONS_FROM_TEMPLATE_ARGS HashMap { ... };

#+END_SRC

** Processing of generated data structures

