doc/hazards.html

<div id="outline-container-org58c3f3d" class="outline-3">
<h3 id="org58c3f3d"><span class="section-number-3">2.2</span> How do you run the blasted thing?</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Easiest way: push to try.</li>
<li>If you want to hack on the analysis:
<ul class="org-ul">
<li>push to try with <code>--upload-xdbs</code></li>
<li>use <code>js/src/devtools/rootAnalysis/analyze.py --first rawcalls</code></li>
</ul></li>
<li>If you are very brave, try to follow the instructions in
<code>js/src/devtools/rootAnalysis/README.md</code></li>
<li>I am working on making it entirely runnable from <code>mach</code>.</li>
</ul>

<pre class="example">
# Install sixgill, matching gcc
mach hazards bootstrap

# Build a shell to run the analysis with
mach hazards build-shell

# Compile the tree and gather analysis info
mach hazards gather

# Analyze the gathered data and report on hazards
mach hazards analyze
</pre>
</div>
</div>

<div id="outline-container-org3f99ad8" class="outline-3">
<h3 id="org3f99ad8"><span class="section-number-3">2.3</span> Operational Overview</h3>
<div class="outline-text-3" id="text-2-3">
<ol class="org-ol">
<li>Start up a server to gather the results of compilation</li>
<li>Compile the entire source tree, with a plugin that sends the control flow
graph over to the server.</li>
<li>Compile a JS shell (optimized, no debug, &#x2013;enable-ctypes)</li>
<li>Run the shell on some JS scripts that load in the compilation results and
analyzes them.</li>
</ol>

<p>
(More details later)
</p>
</div>
</div>

<div id="outline-container-orgdf8847b" class="outline-3">
<h3 id="orgdf8847b"><span class="section-number-3">2.4</span> Data structures</h3>
<div class="outline-text-3" id="text-2-4">
</div>
<div id="outline-container-org20246b2" class="outline-4">
<h4 id="org20246b2"><span class="section-number-4">2.4.1</span> gcc data structure</h4>
<div class="outline-text-4" id="text-2-4-1">
<ul class="org-ul">
<li>nasty awful opaque 'tree' type with unions of structs of unions of unions&#x2026;</li>
<li>accessed via macros, some of which typecheck</li>
<li>newer features reuse old fields and accessors</li>
<li>it all feels pretty random</li>
</ul>

<pre class="example">
bool XIL_IsBaseField(tree field, bool *offset_zero)
{
  if (c_dialect_cxx() &amp;&amp; DECL_NAME(field) == NULL) {
    tree type = TREE_TYPE(field);
    tree idnode = TYPE_NAME(type);
    if (TREE_CODE(type) == RECORD_TYPE &amp;&amp; idnode &amp;&amp;
        TREE_CODE(idnode) == TYPE_DECL &amp;&amp; !XIL_IsAnonymousCxx(idnode)) {
      // figure out if this field is at offset zero.
      tree offset = DECL_FIELD_OFFSET(field);
      tree bit_offset = DECL_FIELD_BIT_OFFSET(field);
      int byte_offset = TREE_UINT(offset) + (TREE_UINT(bit_offset) / 8);

      if (offset_zero)
        *offset_zero = (byte_offset == 0);
      return true;
    }
  }

  return false;
}
</pre>
</div>
</div>

<div id="outline-container-org43fc24e" class="outline-4">
<h4 id="org43fc24e"><span class="section-number-4">2.4.2</span> sixgill data structures</h4>
<div class="outline-text-4" id="text-2-4-2">
</div>
<ol class="org-ol">
<li><a id="org0c1e079"></a>Sample C++ source<br />
<div class="outline-text-5" id="text-2-4-2-1">
<pre class="example">
static void DeleteOffThreadJob(JSContext* cx, OffThreadJob* job) {
  ShellContext* sc = GetShellContext(cx);
  for (size_t i = 0; i &lt; sc-&gt;offThreadJobs.length(); i++) {
    if (sc-&gt;offThreadJobs[i] == job) {
      sc-&gt;offThreadJobs.erase(&amp;sc-&gt;offThreadJobs[i]);
      js_delete(job);
      return;
    }
  }

  MOZ_CRASH("Off-thread job not found");
}
</pre>
</div>
</li>

<li><a id="org80bbb96"></a>Portion of sixgill output<br />
<div class="outline-text-5" id="text-2-4-2-2">
<pre class="example">
block: _ZL1...$js.cpp:void DeleteOffThreadJob...:loop#0
pentry: 1
pexit:  6
Call(1,2, __temp_1 := sc*.offThreadJobs.length())
Assume(2,3, (i* &lt; __temp_1*), true)
Call(3,4, __temp_2 := sc*.offThreadJobs.operator[](i*))
Assume(4,5, (__temp_2** ==p{js::shell::OffThreadJob} job*), false)
Assign(5,6, i := (i* + 1))

block: _ZL1...$js.cpp:void DeleteOffThreadJob...
pentry: 1
pexit:  15
Call(1,2, sc := GetShellContext(cx*))
Assign(2,3, i := 0)
Loop(3,4, loop#0)
Call(4,5, __temp_1 := sc*.offThreadJobs.length())
Assume(5,6, (i* &lt; __temp_1*), true)
Assume(5,11, (i* &lt; __temp_1*), false)
Call(6,7, __temp_2 := sc*.offThreadJobs.operator[](i*))
Assume(7,8, (__temp_2** ==p{js::shell::OffThreadJob} job*), true)
Call(8,9, __temp_3 := sc*.offThreadJobs.operator[](i*))
Call(9,10, sc*.offThreadJobs.erase(__temp_3*))
Call(10,15, js_delete(job*))
Call(11,12, MOZ_ReportCrash("Off-thread job not found","/builds/worker/checkouts/gecko/js/src/shell/js.cpp",390))
Call(12,13, AnnotateMozCrashReason("MOZ_CRASH(Off-thread job not found)"))
Assign(13,14, 0 := 390)
Call(14,15, abort())
</pre>

<p>
QUESTION: In that loop body, why isn't there an edge from 2 -&gt; 6?? (through an Assume)
</p>
</div>
</li>

<li><a id="org89336be"></a>Basic data structure setup<br />
<div class="outline-text-5" id="text-2-4-2-3">
<ul class="org-ul">
<li>Each function gets translated into a <code>Block</code>.</li>
<li>A <code>Block</code> has declarations and things, then one or more ~Body~s
<ul class="org-ul">
<li>One <code>Body</code> for the overall function body</li>
<li>One <code>Body</code> for each loop within the function</li>
</ul></li>
<li>A <code>Body</code> is a list of edges (type <code>PEdge</code>)</li>
<li>This is the control flow graph</li>
<li>Edges connect <code>PPoints</code>. All computation happens on the edges.</li>
<li><code>PEdge</code> has a field <code>Index</code> that gives the src and dst ~PPoint~s</li>
<li>Edges can be one of a small number of types:
<ul class="org-ul">
<li><code>Assign</code>: assignment, lhs := rhs</li>
<li><code>Call</code>: function invocation. May also include an assignment of the returned value.</li>
<li><code>Assume</code>: branch of a conditional</li>
<li><code>Loop</code>: entry to a loop, represented by another <code>Body</code></li>
<li><code>Assembly</code>: inline assembly code</li>
</ul></li>
<li><code>PEdges</code> contain values, which may be expressions
<ul class="org-ul">
<li>but no calls embedded within values; if that happens, the call will happen first and the return
value assigned to a temporary that is then used within the value</li>
</ul></li>
<li>~Body~s have a single entry point and a single exit point</li>
</ul>
</div>
</li>

<li><a id="org10cbaeb"></a>Simplified example fragment<br />
<div class="outline-text-5" id="text-2-4-2-4">
<ul class="org-ul">
<li>Block "foo()"
<ul class="org-ul">
<li>pentry (ID of starting point)</li>
<li>pexit (ID of ending point)</li>
<li>PEdge
<ul class="org-ul">
<li>0
<ul class="org-ul">
<li>Index: 1, 2 (this is the 1 -&gt; 2 edge)</li>
<li>Kind: Assign</li>
<li>Type
<ul class="org-ul">
<li>Kind: Int</li>
</ul></li>
<li>Exp
<ul class="org-ul">
<li>0 (aka lhs)
<ul class="org-ul">
<li>Kind: Var</li>
<li>Variable
<ul class="org-ul">
<li>Kind: Local</li>
<li>Name: someLocalVariable</li>
</ul></li>
</ul></li>
<li>1 (aka rhs)
<ul class="org-ul">
<li>Kind: Binop</li>
<li>OpCode: Plus</li>
<li>Exp
<ul class="org-ul">
<li>0
<ul class="org-ul">
<li>Kind: Drf</li>
<li>&#x2026;more&#x2026;</li>
</ul></li>
<li>1
<ul class="org-ul">
<li>&#x2026;more&#x2026;</li>
</ul></li>
</ul></li>
</ul></li>
</ul></li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
</li>
</ol>
</div>
</div>


<div id="outline-container-org03c6b81" class="outline-3">
<h3 id="org03c6b81"><span class="section-number-3">2.5</span> Compilation</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Only including what I think might be relevant to this audience.
</p>
</div>

<div id="outline-container-org8e037b7" class="outline-4">
<h4 id="org8e037b7"><span class="section-number-4">2.5.1</span> Annotations</h4>
<div class="outline-text-4" id="text-2-5-1">
<p>
Currently expands to <code>__attribute__((annotate("stuff")))</code>.
</p>

<p>
My apologies for the names. Surprisingly enough, I was <b>not</b> intentionally
going for the "I can haz cheezburger" vibe.
</p>

<ul class="org-ul">
<li>JS_HAZ_GC_POINTER : this type holds a GC pointer, possibly encoded.</li>
<li>JS_HAZ_ROOTED : this type roots its contained GC pointer.</li>
<li>JS_HAZ_GC_INVALIDATED : this type contains something that is invalidated during a GC.</li>
<li>JS_HAZ_ROOTED_BASE : all subclasses will be considered rooted
<ul class="org-ul">
<li>JS_HAZ_ROOTED type subclasses don't get this treatment. Most can't really
be subclasses usefully in the first place, and they might add unrooted
fields if they were.</li>
</ul></li>
<li>MOZ_INHERIT_TYPE_ANNOTATIONS_FROM_TEMPLATE_ARGS : shared with the clang-based
static analyses, indicates that eg HashMap&lt;T,U&gt; is a GC pointer (well,
invalidated by GC) iff T or U are GC pointers.</li>
</ul>

<pre class="example">

namespace JS {
class JS_HAZ_GC_POINTER Value { ... };

class JS_HAZ_ROOTED Rooted { ... };

class AutoCheckCannotGC : public AutoAssertNoGC {
  ...
} JS_HAZ_GC_INVALIDATED;

class JS_HAZ_ROOTED_BASE AutoRooter { ... }

} /* namespace JS */

class MOZ_INHERIT_TYPE_ANNOTATIONS_FROM_TEMPLATE_ARGS HashMap { ... };

</pre>
</div>
</div>
</div>

<div id="outline-container-orgbcd4bc3" class="outline-3">
<h3 id="orgbcd4bc3"><span class="section-number-3">2.6</span> Processing of generated data structures</h3>
<div class="outline-text-3" id="text-2-6">
</div>
