doc/hazards.org
*** Compute the global callgraph

- Resolves virtual method edges to all implementations of that method (based
  on the static type).
- Assume that we see all relevant source code; no binary extensions allowed.

*** Compute the set of GC types and GC pointers

- Start from the annotations, and trace through inheritance tree.

*** Compute the set of functions that can GC.

- The core is a simple reachability analysis in the global callgraph.
- But also handle cases where GC is suppressed within an RAII scope.
  - Function can reach GC but is always called with GC suppressed?
- Nasty case that doesn't matter much: recursive roots
  - A() <--> B(), nothing calls either one, one or the other calls other stuff
- Generic callee any/all properties (any/all paths to F are within the scope where
  some property holds)
  - TODO: same for *caller* any/all properties (relative to a root or set of roots)
  - This will be further explained a little later.
- So set ~canGC~ to the set of functions that can reach a GC invocation, but
  are not in ~all(LIMIT_CANNOT_GC)~.

/Gory details of eliminating suppressed-GC functions from ~canGC~/

Consider:

#+BEGIN_SRC
void foo() {
    doSomethingThatMightGC();
}

void indirectGCExceptNot() {
    AutoSuppressGC nogc;
    foo();
}
#+END_SRC

Assuming no other calls to ~indirectGCExceptNot()~, ~indirectGCExceptNot~ is
/not/ in ~canGC~ because GC is always suppressed when it is called. This is
important when locally analyzing a function that calls ~indirectGCExceptNot~
with a GC pointer held live, because locally it very much looks like a hazard.
(If the suppression is in the same function, then it's easy and it wouldn't
matter whether the callee is in ~canGC~ or not. But if it's in the caller,
local analysis can't see it.)

*** Analyze every function in the code base

Iterate over functions and look for unrooted GC pointers held live across a
potential GC. Reiterating:

- Unrooted: If a pointer is stored in a Rooted and extracted when needed, then
  the copy in the Rooted is safe. If a value is extracted, GC happens, and then
  the value is used again, this is problematic because the extracted value is
  unrooted.
- GC pointer: it must be a pointer to a GC cell. A pointer to a pointer to a GC
  cell will not be invalidated. (The pointed-to cell should either be rooted or
  traced so that it gets updated.)
- held live: an invalidated GC pointer is harmless unless it is used again
  after the GC.
- live across a potential GC: in static analysis terms, the value is considered
  to be "live" from the pointer where it was generated to the last time it is
  used. We are looking for a potential GC within that range.

#+BEGIN_SRC

void foo() {
    doSomethingThatMightGC();
}

void indirectGCExceptNot() {
    AutoSuppressGC nogc;
    foo();
}

void carbon() {
    JSObject* obj = JS::NewObject();
    indirectGCExceptNot();
    use(obj);
}

void main() {
    bar();
    foo();
}
#+END_SRC

Can ~foo()~ GC? Yes, but only in the call from ~main()~. So it will be in
~canGC~. ~indirectGCExceptNot~ will not be in the set.

When analyzing ~carbon()~, ~obj~ is live across ~indirectGCExceptNot()~, which
is fine because it is not in ~canGC~.

Now consider:

#+BEGIN_SRC
void obvious_hazard() {
    JSObject* obj = JS::NewObject();
    doSomethingThatMightGC();
}

void bar2() {
    AutoSuppressGC nogc;
    obvious_hazard();
}
#+END_SRC

Assume there are no other calls to ~obvious_hazard()~ in the program. Should
this report a hazard? No! The whole point of ~AutoSuppressGC~ is to be able to
do stuff without worrying about a GC happening and messing everything up. If
there aren't hazards within its scope, either directly or in called functions,
then why is ~AutoSuppressGC~ there in the first place?

From the analysis's point of view, ~any(LIMIT_CANNOT_GC)~ contains both ~foo~
and ~obvious_hazard~, while ~all(LIMIT_CANNOT_GC)~ contains only
~obvious_hazard~. (~any(LIMIT_CANNOT_GC)~ is never used; it's a currently
useless byproduct. Though it ought to be used to suppress warnings of excessive
rooting.)

The full set of functions that can GC is all functions that can reach a GC
invocation through the callee graph, but are not in the ~all(LIMIT_CANNOT_GC)~
set. This is the ~canGC~ set.

Note that when analyzing ~bar2~, we don't need to consider
~all(LIMIT_CANNOT_GC)~ or ~canGC~ at all -- even if ~obvious_hazard~ were in
~canGC~, we only call it within ~AutoSuppressGC~ so it wouldn't produce a
hazard anyway. ~all(LIMIT_CANNOT_GC)~ is for the benefit of the local analysis
of called functions, not callers, a fact that I repeatedly forget.

*** In-depth look at main analysis function

- Look at a single function (~processBodies()~)
- Loop over all variables in the function (parameters, locals, ~this~, return
  value)
  - If the variable is unrooted, look at every edge in every body (~variableLiveAcrossGC()~)
    - if the edge is just clobbering a previous value, ignore the edge
    - if the edge uses the variable's value, look for a GC before the use (~findGCBeforeValueUse()~)

~findGCBeforeValueUse(start_point)~:

- start a backwards DFS through the body, starting at ~start_point~
- record whether or not a GC was seen yet at every point in the traversal
  - or rather, a function in ~canGC~
- if an edge "kills" the variable's value (in reverse search order, so it's
  really generating the value that is live across the GC), stop the search
  - examples:
    - ~obj = foo()~
    - ~obj = aObj~
    - ~MyClass c(...)~
  - this is the beginning of the variable's live range
  - report the hazard if we've found a GC by now
- if an edge uses the variable's value, same as above but don't terminate the
  search if a GC hasn't been found
  - dump traversal of the sixigll ~Exp~ression datatype to find references to
    the variable
  - as a usability hack, don't terminate the search even if a GC /has/ been
    found; continue backwards until a "better" use is encountered.
    - ~obj = foo(); use1(obj); GC(); use2(obj);~
- funky special case: some edges can "invalidate" a variable, which means
  "whoops you thought it was live but it really wasn't"
  - examples:
    - ~UniquePtr.reset()~
    - ~obj = nullptr~
    - ~foo(std::move(obj))~
- if a loop is encountered, propagate into it (to the exit point of the loop)
- if we revisit a point, terminate the search if the earlier visitor in the
  backwards scan already found a GC call by this point
- when processing a loop body and its entry point is reached, propagate to the
  predecessors in the "caller"
- also propagate to the end of this loop (for the previous iteratiom)

I'm honestly not sure why the scan goes backwards.

