doc/hazards.html
<div id="outline-container-org1a7e914" class="outline-4">
<h4 id="org1a7e914"><span class="section-number-4">2.6.1</span> Compute the global callgraph</h4>
<div class="outline-text-4" id="text-2-6-1">
<ul class="org-ul">
<li>Resolves virtual method edges to all implementations of that method (based
on the static type).</li>
<li>Assume that we see all relevant source code; no binary extensions allowed.</li>
</ul>
</div>
</div>

<div id="outline-container-org4785a52" class="outline-4">
<h4 id="org4785a52"><span class="section-number-4">2.6.2</span> Compute the set of GC types and GC pointers</h4>
<div class="outline-text-4" id="text-2-6-2">
<ul class="org-ul">
<li>Start from the annotations, and trace through inheritance tree.</li>
</ul>
</div>
</div>

<div id="outline-container-orgf66e36f" class="outline-4">
<h4 id="orgf66e36f"><span class="section-number-4">2.6.3</span> Compute the set of functions that can GC.</h4>
<div class="outline-text-4" id="text-2-6-3">
<ul class="org-ul">
<li>The core is a simple reachability analysis in the global callgraph.</li>
<li>But also handle cases where GC is suppressed within an RAII scope.
<ul class="org-ul">
<li>Function can reach GC but is always called with GC suppressed?</li>
</ul></li>
<li>Nasty case that doesn't matter much: recursive roots
<ul class="org-ul">
<li>A() &lt;&#x2013;&gt; B(), nothing calls either one, one or the other calls other stuff</li>
</ul></li>
<li>Generic callee any/all properties (any/all paths to F are within the scope where
some property holds)
<ul class="org-ul">
<li>TODO: same for <b>caller</b> any/all properties (relative to a root or set of roots)</li>
<li>This will be further explained a little later.</li>
</ul></li>
<li>So set <code>canGC</code> to the set of functions that can reach a GC invocation, but
are not in <code>all(LIMIT_CANNOT_GC)</code>.</li>
</ul>

<p>
<i>Gory details of eliminating suppressed-GC functions from <code>canGC</code></i>
</p>

<p>
Consider:
</p>

<pre class="example">
void foo() {
    doSomethingThatMightGC();
}

void indirectGCExceptNot() {
    AutoSuppressGC nogc;
    foo();
}
</pre>

<p>
Assuming no other calls to <code>indirectGCExceptNot()</code>, <code>indirectGCExceptNot</code> is
<i>not</i> in <code>canGC</code> because GC is always suppressed when it is called. This is
important when locally analyzing a function that calls <code>indirectGCExceptNot</code>
with a GC pointer held live, because locally it very much looks like a hazard.
(If the suppression is in the same function, then it's easy and it wouldn't
matter whether the callee is in <code>canGC</code> or not. But if it's in the caller,
local analysis can't see it.)
</p>
</div>
</div>

<div id="outline-container-org19833fc" class="outline-4">
<h4 id="org19833fc"><span class="section-number-4">2.6.4</span> Analyze every function in the code base</h4>
<div class="outline-text-4" id="text-2-6-4">
<p>
Iterate over functions and look for unrooted GC pointers held live across a
potential GC. Reiterating:
</p>

<ul class="org-ul">
<li>Unrooted: If a pointer is stored in a Rooted and extracted when needed, then
the copy in the Rooted is safe. If a value is extracted, GC happens, and then
the value is used again, this is problematic because the extracted value is
unrooted.</li>
<li>GC pointer: it must be a pointer to a GC cell. A pointer to a pointer to a GC
cell will not be invalidated. (The pointed-to cell should either be rooted or
traced so that it gets updated.)</li>
<li>held live: an invalidated GC pointer is harmless unless it is used again
after the GC.</li>
<li>live across a potential GC: in static analysis terms, the value is considered
to be "live" from the pointer where it was generated to the last time it is
used. We are looking for a potential GC within that range.</li>
</ul>

<pre class="example">

void foo() {
    doSomethingThatMightGC();
}

void indirectGCExceptNot() {
    AutoSuppressGC nogc;
    foo();
}

void carbon() {
    JSObject* obj = JS::NewObject();
    indirectGCExceptNot();
    use(obj);
}

void main() {
    bar();
    foo();
}
</pre>

<p>
Can <code>foo()</code> GC? Yes, but only in the call from <code>main()</code>. So it will be in
<code>canGC</code>. <code>indirectGCExceptNot</code> will not be in the set.
</p>

<p>
When analyzing <code>carbon()</code>, <code>obj</code> is live across <code>indirectGCExceptNot()</code>, which
is fine because it is not in <code>canGC</code>.
</p>

<p>
Now consider:
</p>

<pre class="example">
void obvious_hazard() {
    JSObject* obj = JS::NewObject();
    doSomethingThatMightGC();
}

void bar2() {
    AutoSuppressGC nogc;
    obvious_hazard();
}
</pre>

<p>
Assume there are no other calls to <code>obvious_hazard()</code> in the program. Should
this report a hazard? No! The whole point of <code>AutoSuppressGC</code> is to be able to
do stuff without worrying about a GC happening and messing everything up. If
there aren't hazards within its scope, either directly or in called functions,
then why is <code>AutoSuppressGC</code> there in the first place?
</p>

<p>
From the analysis's point of view, <code>any(LIMIT_CANNOT_GC)</code> contains both <code>foo</code>
and <code>obvious_hazard</code>, while <code>all(LIMIT_CANNOT_GC)</code> contains only
<code>obvious_hazard</code>. (<code>any(LIMIT_CANNOT_GC)</code> is never used; it's a currently
useless byproduct. Though it ought to be used to suppress warnings of excessive
rooting.)
</p>

<p>
The full set of functions that can GC is all functions that can reach a GC
invocation through the callee graph, but are not in the <code>all(LIMIT_CANNOT_GC)</code>
set. This is the <code>canGC</code> set.
</p>

<p>
Note that when analyzing <code>bar2</code>, we don't need to consider
<code>all(LIMIT_CANNOT_GC)</code> or <code>canGC</code> at all &#x2013; even if <code>obvious_hazard</code> were in
<code>canGC</code>, we only call it within <code>AutoSuppressGC</code> so it wouldn't produce a
hazard anyway. <code>all(LIMIT_CANNOT_GC)</code> is for the benefit of the local analysis
of called functions, not callers, a fact that I repeatedly forget.
</p>
</div>
</div>

<div id="outline-container-org47baf7d" class="outline-4">
<h4 id="org47baf7d"><span class="section-number-4">2.6.5</span> In-depth look at main analysis function</h4>
<div class="outline-text-4" id="text-2-6-5">
<ul class="org-ul">
<li>Look at a single function (<code>processBodies()</code>)</li>
<li>Loop over all variables in the function (parameters, locals, <code>this</code>, return
value)
<ul class="org-ul">
<li>If the variable is unrooted, look at every edge in every body (<code>variableLiveAcrossGC()</code>)
<ul class="org-ul">
<li>if the edge is just clobbering a previous value, ignore the edge</li>
<li>if the edge uses the variable's value, look for a GC before the use (<code>findGCBeforeValueUse()</code>)</li>
</ul></li>
</ul></li>
</ul>

<p>
<code>findGCBeforeValueUse(start_point)</code>:
</p>

<ul class="org-ul">
<li>start a backwards DFS through the body, starting at <code>start_point</code></li>
<li>record whether or not a GC was seen yet at every point in the traversal
<ul class="org-ul">
<li>or rather, a function in <code>canGC</code></li>
</ul></li>
<li>if an edge "kills" the variable's value (in reverse search order, so it's
really generating the value that is live across the GC), stop the search
<ul class="org-ul">
<li>examples:
<ul class="org-ul">
<li><code>obj = foo()</code></li>
<li><code>obj = aObj</code></li>
<li><code>MyClass c(...)</code></li>
</ul></li>
<li>this is the beginning of the variable's live range</li>
<li>report the hazard if we've found a GC by now</li>
</ul></li>
<li>if an edge uses the variable's value, same as above but don't terminate the
search if a GC hasn't been found
<ul class="org-ul">
<li>dump traversal of the sixigll ~Exp~ression datatype to find references to
the variable</li>
<li>as a usability hack, don't terminate the search even if a GC <i>has</i> been
found; continue backwards until a "better" use is encountered.
<ul class="org-ul">
<li><code>obj = foo(); use1(obj); GC(); use2(obj);</code></li>
</ul></li>
</ul></li>
<li>funky special case: some edges can "invalidate" a variable, which means
"whoops you thought it was live but it really wasn't"
<ul class="org-ul">
<li>examples:
<ul class="org-ul">
<li><code>UniquePtr.reset()</code></li>
<li><code>obj = nullptr</code></li>
<li><code>foo(std::move(obj))</code></li>
</ul></li>
</ul></li>
<li>if a loop is encountered, propagate into it (to the exit point of the loop)</li>
<li>if we revisit a point, terminate the search if the earlier visitor in the
backwards scan already found a GC call by this point</li>
<li>when processing a loop body and its entry point is reached, propagate to the
predecessors in the "caller"</li>
<li>also propagate to the end of this loop (for the previous iteratiom)</li>
</ul>

<p>
I'm honestly not sure why the scan goes backwards.
</p>
</div>
</div>
