doc/hazards.org
*** Ideas for additional analyses with same infrastructure

The ability to compute ~any/all~ sets for arbitrary properties is potentially
very useful. Here are some possibilities:

**** Can Run Script

Let's say we want to validate the MOZ_CAN_RUN_SCRIPT and
MOZ_CAN_RUN_SCRIPT_BOUNDARY annotations. Specifically, we want to find the set
of functions that can reach ~RunScript()~ without going through
MOZ_CAN_RUN_SCRIPT_BOUNDARY. All such functions should be marked
MOZ_CAN_RUN_SCRIPT or there is an error.

A straightforward implementation:
- Mark ~RunScript()~ with a ~PROP_CAN_RUN_SCRIPT~ bit (property).
- Mark any function annotated with ~MOZ_CAN_RUN_SCRIPT_BOUNDARY~ with a ~PROP_BEHIND_BOUNDARY~ bit.
- Recursively propagate the above bits through the *caller* graph, rooted at ~RunScript()~.
- All functions that are in ~any(PROP_CAN_RUN_SCRIPT)~ but not in
  ~all(PROP_BEHIND_BOUNDARY)~ should be annotated with ~MOZ_CAN_RUN_SCRIPT~, or
  we report an error.

Note that the roots really matter when propagating bits through the caller
graph. If we start at a single function with the ~PROP_CAN_RUN_SCRIPT~ property
bit set, then ~any~ and ~all~ will be the same sets.

There should probably be different names for ~any/all~ depending on whether
they are propagated through the callee graph vs the caller graph.

- ~callee-any(PROP)~ : a given function is reachable when property PROP is true.
- ~callee-all(PROP)~ : a given function is only called when property PROP is true.
- ~caller-any(PROP)~ : a given function can reach a spot where property PROP is true.
- ~caller-all(PROP)~ rooted at set ~roots~ where ~PROP~ is true for all roots :
  a given function can reach all functions in ~roots~.

The ~canGC~ set *could* be computed as ~caller-any(PROP_CAN_GC)~ minus
~callee-all(PROP_CANNOT_GC)~ (assuming the GC entry points were annotated with
~PROP_CAN_GC~) using all leaves or just the GC entry points as the roots.
Sadly, it seems like ~caller-all~ is useless when using all leaves as the
roots. (Any small little leaf would clear the ~caller-all~ property for
anything that can reach it.

Note that this analysis is horribly unsound : if a function calls through a
function pointer that could end up running script, then the analysis will miss
it. To be conservative, we would have to add all function pointers to the root
set as well.

**** Iterator invalidation

Let's say we want to identify mutations to a data structure while an iterator
over that data structure is still active. We could make a ~PROP_LIVE_ITERATOR~
property that is set on any function called with the iterator live, then
propagate that through the callee graph. When analyzing a function in
~callee-any(PROP_LIVE_ITERATOR)~, we can report an iterator invalidation error
when the data structure is mutated.

Note that errors must also be reported on mutations in the parts of a function
that themselves have an iterator active. This wouldn't use the property above.

**** Temporary Register Allocation

If we have RAII controls over temporary register use in the JIT, then we can
verify that you don't attempt to grab the register while it's already in use. A
dynamic check would probably be just as good, though. (If the error is in a
rare codepath, then it's probably handling an error, in which case there's a
good chance the outer temporary usage is going to get aborted anyway. The
dynamic analysis would probably have fewer missed errors than the static
analysis would have false alarms.)

**** Deadlock Detection

This feels like it would probably need either a custom check, or a dynamic
number of properties (one per lock). But if we ignore that and look at one
lock: set a ~PROP_LOCK~ property in the scope of the lock, and error out if we
attempt to take the lock in any function in ~callee-any(PROP_LOCK)~. Though
there are probably temporary unlock regions at times, so this would actually
require a ~PROP_UNLOCK~ property too with rules for combining the bits during
the graph traversal.

Come to think of it, the temporary register checker above would almost
certainly need the same sort of functionality. Each property would need
multiple possible states: unknown, always true, always false, sometimes true,
(sometimes false? sometimes false would be good for detecting unlocked access
to guarded data. But there are already custom analyses for these sorts of
things).

** XDB files

: _ZN2js17NativeGetPropertyEP9JSContextN2JS6HandleIPNS_12NativeObjectEEENS3_INS2_11PropertyKeyEEENS2_13MutableHandleINS2_5ValueEEE$uint8 js::NativeGetProperty(JSContext*, JS::Handle<js::NativeObject*>, JS::Handle<JS::PropertyKey>, JS::MutableHandle<JS::Value>)
