doc/hazards.html

<div id="outline-container-org427c8d5" class="outline-4">
<h4 id="org427c8d5"><span class="section-number-4">2.6.6</span> Ideas for additional analyses with same infrastructure</h4>
<div class="outline-text-4" id="text-2-6-6">
<p>
The ability to compute <code>any/all</code> sets for arbitrary properties is potentially
very useful. Here are some possibilities:
</p>
</div>

<ol class="org-ol">
<li><a id="orgc0cb201"></a>Can Run Script<br />
<div class="outline-text-5" id="text-2-6-6-1">
<p>
Let's say we want to validate the MOZ_CAN_RUN_SCRIPT and
MOZ_CAN_RUN_SCRIPT_BOUNDARY annotations. Specifically, we want to find the set
of functions that can reach <code>RunScript()</code> without going through
MOZ_CAN_RUN_SCRIPT_BOUNDARY. All such functions should be marked
MOZ_CAN_RUN_SCRIPT or there is an error.
</p>

<p>
A straightforward implementation:
</p>
<ul class="org-ul">
<li>Mark <code>RunScript()</code> with a <code>PROP_CAN_RUN_SCRIPT</code> bit (property).</li>
<li>Mark any function annotated with <code>MOZ_CAN_RUN_SCRIPT_BOUNDARY</code> with a <code>PROP_BEHIND_BOUNDARY</code> bit.</li>
<li>Recursively propagate the above bits through the <b>caller</b> graph, rooted at <code>RunScript()</code>.</li>
<li>All functions that are in <code>any(PROP_CAN_RUN_SCRIPT)</code> but not in
<code>all(PROP_BEHIND_BOUNDARY)</code> should be annotated with <code>MOZ_CAN_RUN_SCRIPT</code>, or
we report an error.</li>
</ul>

<p>
Note that the roots really matter when propagating bits through the caller
graph. If we start at a single function with the <code>PROP_CAN_RUN_SCRIPT</code> property
bit set, then <code>any</code> and <code>all</code> will be the same sets.
</p>

<p>
There should probably be different names for <code>any/all</code> depending on whether
they are propagated through the callee graph vs the caller graph.
</p>

<ul class="org-ul">
<li><code>callee-any(PROP)</code> : a given function is reachable when property PROP is true.</li>
<li><code>callee-all(PROP)</code> : a given function is only called when property PROP is true.</li>
<li><code>caller-any(PROP)</code> : a given function can reach a spot where property PROP is true.</li>
<li><code>caller-all(PROP)</code> rooted at set <code>roots</code> where <code>PROP</code> is true for all roots :
a given function can reach all functions in <code>roots</code>.</li>
</ul>

<p>
The <code>canGC</code> set <b>could</b> be computed as <code>caller-any(PROP_CAN_GC)</code> minus
<code>callee-all(PROP_CANNOT_GC)</code> (assuming the GC entry points were annotated with
<code>PROP_CAN_GC</code>) using all leaves or just the GC entry points as the roots.
Sadly, it seems like <code>caller-all</code> is useless when using all leaves as the
roots. (Any small little leaf would clear the <code>caller-all</code> property for
anything that can reach it.
</p>

<p>
Note that this analysis is horribly unsound : if a function calls through a
function pointer that could end up running script, then the analysis will miss
it. To be conservative, we would have to add all function pointers to the root
set as well.
</p>
</div>
</li>

<li><a id="orgfed7f25"></a>Iterator invalidation<br />
<div class="outline-text-5" id="text-2-6-6-2">
<p>
Let's say we want to identify mutations to a data structure while an iterator
over that data structure is still active. We could make a <code>PROP_LIVE_ITERATOR</code>
property that is set on any function called with the iterator live, then
propagate that through the callee graph. When analyzing a function in
<code>callee-any(PROP_LIVE_ITERATOR)</code>, we can report an iterator invalidation error
when the data structure is mutated.
</p>

<p>
Note that errors must also be reported on mutations in the parts of a function
that themselves have an iterator active. This wouldn't use the property above.
</p>
</div>
</li>

<li><a id="org29df91b"></a>Temporary Register Allocation<br />
<div class="outline-text-5" id="text-2-6-6-3">
<p>
If we have RAII controls over temporary register use in the JIT, then we can
verify that you don't attempt to grab the register while it's already in use. A
dynamic check would probably be just as good, though. (If the error is in a
rare codepath, then it's probably handling an error, in which case there's a
good chance the outer temporary usage is going to get aborted anyway. The
dynamic analysis would probably have fewer missed errors than the static
analysis would have false alarms.)
</p>
</div>
</li>

<li><a id="orgb288e5a"></a>Deadlock Detection<br />
<div class="outline-text-5" id="text-2-6-6-4">
<p>
This feels like it would probably need either a custom check, or a dynamic
number of properties (one per lock). But if we ignore that and look at one
lock: set a <code>PROP_LOCK</code> property in the scope of the lock, and error out if we
attempt to take the lock in any function in <code>callee-any(PROP_LOCK)</code>. Though
there are probably temporary unlock regions at times, so this would actually
require a <code>PROP_UNLOCK</code> property too with rules for combining the bits during
the graph traversal.
</p>

<p>
Come to think of it, the temporary register checker above would almost
certainly need the same sort of functionality. Each property would need
multiple possible states: unknown, always true, always false, sometimes true,
(sometimes false? sometimes false would be good for detecting unlocked access
to guarded data. But there are already custom analyses for these sorts of
things).
</p>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-orgba699e1" class="outline-3">
<h3 id="orgba699e1"><span class="section-number-3">2.7</span> XDB files</h3>
<div class="outline-text-3" id="text-2-7">
<pre class="example">
_ZN2js17NativeGetPropertyEP9JSContextN2JS6HandleIPNS_12NativeObjectEEENS3_INS2_11PropertyKeyEEENS2_13MutableHandleINS2_5ValueEEE$uint8 js::NativeGetProperty(JSContext*, JS::Handle&lt;js::NativeObject*&gt;, JS::Handle&lt;JS::PropertyKey&gt;, JS::MutableHandle&lt;JS::Value&gt;)

</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Steve Fink</p>
<p class="date">Created: 2020-02-02 Sun 20:13</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
